#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.rsa_key: Refreshing state... [id=d511b788018d3a64c008626fb9c4d2422b756ac7]
local_file.tfkey: Refreshing state... [id=3492154753a1c4ef1980da2dfe6f286439587aa3]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
data.aws_ami.java-ami: Reading...
aws_security_group.elb: Refreshing state... [id=sg-0df6f482928cbaed7]
aws_vpc.main: Refreshing state... [id=vpc-0b7deca365926d726]
aws_key_pair.terraform_key: Refreshing state... [id=terraform_key]
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-0d5d43469d9358e4c]
data.aws_ami.java-ami: Read complete after 0s [id=ami-0da29c6c74f5da039]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-04dec68a223f184fb]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-08f835873d18f16e9]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-0e91e6cb88eb56858]
aws_security_group.allow_ssh: Refreshing state... [id=sg-0e0f10a5940060ff8]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-0a5261762e65fb3df]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-024f51b39d243ec11]
aws_subnet.privatesubnet_4: Refreshing state... [id=subnet-0300df04a7f990406]
aws_subnet.privatesubnet_3: Refreshing state... [id=subnet-04f71043a1f18890b]
aws_security_group.allow_http: Refreshing state... [id=sg-0fd765a2239419ae5]
aws_route_table.public_route_table: Refreshing state... [id=rtb-004a4da461bf9a4c9]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0b5a3fa7e59395d41]
aws_db_subnet_group.db-subnet-group: Refreshing state... [id=db-subnet-group]
aws_launch_template.ec2_config: Refreshing state... [id=lt-01f3eac3ea98bf053]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-0b953e9d209b8bc2e]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-0b9b3fd5e2af896a7]
aws_route_table.private_route_table: Refreshing state... [id=rtb-0ac7e07d6111d8478]
aws_autoscaling_group.auto_scaling_group: Refreshing state... [id=Auto Scaling Group]
aws_route_table_association.private_route_table_association_3: Refreshing state... [id=rtbassoc-0f633fc599d391e79]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-055d6123ff945991d]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-0a85999bc9b5a69db]
aws_route_table_association.private_route_table_association_4: Refreshing state... [id=rtbassoc-0c053d7fe961fe64d]
aws_db_instance.postgres-db: Refreshing state... [id=terraform-20230823214948022600000001]
aws_autoscaling_attachment.asg_attachment: Refreshing state... [id=Auto Scaling Group-20230823215036630900000005]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_launch_template.ec2_config has changed
  ~ resource "aws_launch_template" "ec2_config" {
        id                      = "lt-01f3eac3ea98bf053"
      ~ latest_version          = 1 -> 2
        name                    = "terraform-20230823214948029800000002"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment will be created
  + resource "aws_autoscaling_attachment" "asg_attachment" {
      + alb_target_group_arn   = (known after apply)
      + autoscaling_group_name = "Auto Scaling Group"
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.auto_scaling_group will be updated in-place
  ~ resource "aws_autoscaling_group" "auto_scaling_group" {
        id                        = "Auto Scaling Group"
        name                      = "Auto Scaling Group"
        # (23 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-01f3eac3ea98bf053"
            name    = "terraform-20230823214948029800000002"
          ~ version = "2" -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_launch_template.ec2_config will be updated in-place
  ~ resource "aws_launch_template" "ec2_config" {
      ~ default_version         = 2 -> (known after apply)
        id                      = "lt-01f3eac3ea98bf053"
      ~ latest_version          = 2 -> (known after apply)
        name                    = "terraform-20230823214948029800000002"
        tags                    = {}
        # (12 unchanged attributes hidden)

      ~ network_interfaces {
          ~ security_groups             = [
              - "sg-0c477b94a2d04f7fe",
              - "sg-0e0f10a5940060ff8",
              - "sg-0fd765a2239419ae5",
            ] -> (known after apply)
            # (11 unchanged attributes hidden)
        }
    }

  # aws_lb.application-load-balancer will be created
  + resource "aws_lb" "application-load-balancer" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "ALB"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-024f51b39d243ec11",
          + "subnet-0a5261762e65fb3df",
        ]
      + tags                       = {
          + "Name" = "Application Load Balancer"
        }
      + tags_all                   = {
          + "Name" = "Application Load Balancer"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "OK"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "my-target-group"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "http"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/actuator/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "alb security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "security_group_alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0b7deca365926d726"
    }

  # aws_security_group.elb will be destroyed
  # (because aws_security_group.elb is not in configuration)
  - resource "aws_security_group" "elb" {
      - arn                    = "arn:aws:ec2:us-east-1:161098427198:security-group/sg-0df6f482928cbaed7" -> null
      - description            = "elb security group" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0df6f482928cbaed7" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "security_group_elb" -> null
      - owner_id               = "161098427198" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-0b7deca365926d726" -> null
    }

  # local_file.tfkey will be created
  + resource "local_file" "tfkey" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "tfkey"
      + id                   = (known after apply)
    }

Plan: 6 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*